zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_modcon.h
/*
 * Copyright 2025 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef _FSL_MODCON_H_
#define _FSL_MODCON_H_

#include <stdint.h>
#include "fsl_common.h"

/*! @addtogroup modcon */
/*! @{ */

/*! @file */

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*! @name Driver version */
/*@{*/
/*! @brief MODCON driver version. */
#define FSL_MODCON_DRIVER_VERSION (MAKE_VERSION(1, 0, 0))
/*! @} */

/*! @brief MODCON IP name arrays */

/*! @brief MODCON IP name array for ASRC. */
#define ASRC_MODCONS                                                                                                                       \
    {                                                                                                                                      \
        (uint32_t)kModCon_AUDIO_ASRC                                                                                                       \
    }                                                                                                                                      \

/*! @brief MODCON IP name array for SPDIF. */
#define SPDIF_MODCONS                                                                                                                      \
    {                                                                                                                                      \
        (uint32_t)kModCon_AUDIO_SPDIF                                                                                                      \
    }                                                                                                                                      \

/*! @brief MODCON IP name array for SAI. */
#define SAI_MODCONS                                                                                                                        \
    {                                                                                                                                      \
        (uint32_t)kModCon_AUDIO_SAI0, (uint32_t)kModCon_AUDIO_SAI1, (uint32_t)kModCon_AUDIO_SAI2                                           \
    }                                                                                                                                      \

/*! @brief MODCON IP name array for PDM. */
#define PDM_MODCONS                                                                                                                        \
    {                                                                                                                                      \
        (uint32_t)kModCon_AUDIO_MIC, (uint32_t)kModCon_WAKE_MIC                                                                            \
    }                                                                                                                                      \

/*! @brief MODCON IP name array for FREQME. */
#define FREQME_MODCONS                                                                                                                     \
    {                                                                                                                                      \
        (uint32_t)kModCon_AUDIO_FREQME, (uint32_t)kModCon_CMPT_FREQME, (uint32_t)kModCon_COMM_FREQME,                                      \
        (uint32_t)kModCon_MAIN_FREQME, (uint32_t)kModCon_MEDIA_FREQME, (uint32_t)kModCon_WAKE_FREQME                                       \
    }                                                                                                                                      \

/*! @brief MODCON IP name array for EDMA3. */
#define EDMA3_MODCONS                                                                                                                      \
    {                                                                                                                                      \
        (uint32_t)kModCon_AUDIO_EDMA, (uint32_t)kModCon_MAIN_EDMA0, (uint32_t)kModCon_WAKE_EDMA                                            \
    }                                                                                                                                      \

/*! @brief MODCON IP name array for EDMA5. */
#define EDMA5_MODCONS                                                                                                                      \
    {                                                                                                                                      \
        (uint32_t)kModCon_MAIN_EDMA1                                                                                                       \
    }                                                                                                                                      \

/*! @brief MODCON IP name array for NPU. */
#define NPU_MODCONS                                                                                                                        \
    {                                                                                                                                      \
        (uint32_t)kModCon_CMPT_NPU                                                                                                         \
    }                                                                                                                                      \

/*! @brief MODCON IP name array for SRAMCTL. */
#define SRAMCTL_MODCONS                                                                                                                    \
    {                                                                                                                                      \
        (uint32_t)kModCon_CMPT_SRAMCTL0, (uint32_t)kModCon_CMPT_SRAMCTL1, (uint32_t)kModCon_CMPT_SRAMCTL2                                  \
    }                                                                                                                                      \

