zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_modcon.h
/*! @brief MODCON IP name array for NIC. */
#define NIC_MODCONS                                                                                                                        \
    {                                                                                                                                      \
        (uint32_t)kModCon_COMM_NIC, (uint32_t)kModCon_MAIN_NIC, (uint32_t)kModCon_MEDIA_NIC                                                \
    }                                                                                                                                      \

/*! @brief MODCON IP name array for ROMCP. */
#define ROMCP_MODCONS                                                                                                                      \
    {                                                                                                                                      \
        (uint32_t)kModCon_CMPT_ROMCP                                                                                                       \
    }                                                                                                                                      \

/*! @brief MODCON IP name array for ENET. */
#define ENET_MODCONS                                                                                                                       \
    {                                                                                                                                      \
        (uint32_t)kModCon_COMM_ETH0,                                                                                                       \
    }                                                                                                                                      \

/*! @brief MODCON IP name array for ENET_QOS. */
#define ENET_QOS_MODCONS                                                                                                                   \
    {                                                                                                                                      \
        (uint32_t)kModCon_COMM_ETH1,                                                                                                       \
    }                                                                                                                                      \

/*! @brief MODCON IP name array for TENBASET_PHY. */
#define TENBASET_PHY_MODCONS                                                                                                               \
    {                                                                                                                                      \
        (uint32_t)kModCon_COMM_XENOPHY0, (uint32_t)kModCon_COMM_XENOPHY1                                                                   \
    }                                                                                                                                      \

/*! @brief MODCON IP name array for USDHC. */
#define USDHC_MODCONS                                                                                                                      \
    {                                                                                                                                      \
        (uint32_t)kModCon_COMM_USDHC0, (uint32_t)kModCon_COMM_USDHC1                                                                       \
    }                                                                                                                                      \

/*! @brief MODCON IP name array for XSPIR. */
#define XSPIR_MODCONS                                                                                                                      \
    {                                                                                                                                      \
        (uint32_t)kModCon_COMM_XSPIR                                                                                                       \
    }                                                                                                                                      \

/*! @brief MODCON IP name array for XSPI. */
#define XSPI_MODCONS                                                                                                                       \
    {                                                                                                                                      \
        (uint32_t)kModCon_MAIN_XSPI0, (uint32_t)kModCon_MAIN_XSPI1                                                                         \
    }                                                                                                                                      \
    
/*! @brief MODCON IP name array for SRAMC. */
#define SRAMC_MODCONS                                                                                                                      \
    {                                                                                                                                      \
        (uint32_t)kModCon_MAIN_SRAMC                                                                                                       \
    }                                                                                                                                      \

/*! @brief MODCON IP name array for I3C. */
#define I3C_MODCONS                                                                                                                        \
    {                                                                                                                                      \
        (uint32_t)kModCon_MAIN_I3C, (uint32_t)kModCon_WAKE_I3C                                                                             \
    }                                                                                                                                      \

/*! @brief MODCON IP name array for LPSPI. */
#define LPSPI_MODCONS                                                                                                                      \
    {                                                                                                                                      \
        (uint32_t)kModCon_MAIN_LPSPI0, (uint32_t)kModCon_MAIN_LPSPI1, (uint32_t)kModCon_MAIN_LPSPI2,                                       \
        (uint32_t)kModCon_MAIN_LPSPI3, (uint32_t)kModCon_MAIN_LPSPI4, (uint32_t)kModCon_WAKE_LPSPI                                         \
    }                                                                                                                                      \

/*! @brief MODCON IP name array for LPI2C. */
#define LPI2C_MODCONS                                                                                                                      \
    {                                                                                                                                      \
        (uint32_t)kModCon_MAIN_LPI2C0, (uint32_t)kModCon_MAIN_LPI2C1, (uint32_t)kModCon_WAKE_LPI2C0, (uint32_t)kModCon_WAKE_LPI2C1         \
    }                                                                                                                                      \

/*! @brief MODCON IP name array for LPUART. */
#define LPUART_MODCONS                                                                                                                     \
    {                                                                                                                                      \
        (uint32_t)kModCon_MAIN_LPUART0, (uint32_t)kModCon_MAIN_LPUART1, (uint32_t)kModCon_MAIN_LPUART2, (uint32_t)kModCon_MAIN_LPUART3,    \
        (uint32_t)kModCon_MAIN_LPUART4, (uint32_t)kModCon_MAIN_LPUART5, (uint32_t)kModCon_WAKE_LPUART0, (uint32_t)kModCon_WAKE_LPUART1     \
    }                                                                                                                                      \

