zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_modcon.h
/*! @brief MODCON IP name array for CAN. */
#define CAN_MODCONS                                                                                                                        \
    {                                                                                                                                      \
        (uint32_t)kModCon_MAIN_CAN0, (uint32_t)kModCon_MAIN_CAN1, (uint32_t)kModCon_MAIN_CAN2                                              \
    }                                                                                                                                      \

/*! @brief MODCON IP name array for EQDC. */
/* TBC :Is eqdc equal to qdec?*/
#define EQDC_MODCONS                                                                                                                       \
    {                                                                                                                                      \
        (uint32_t)kModCon_MAIN_EQDC0, (uint32_t)kModCon_MAIN_EQDC1, (uint32_t)kModCon_MAIN_EQDC2, (uint32_t)kModCon_MAIN_EQDC3             \
    }                                                                                                                                      \

/*! @brief MODCON IP name array for GPIO. */
 /* TBC need further check for VBAT*/
#define GPIO_MODCONS                                                                                                                       \
    {                                                                                                                                      \
        (uint32_t)kModCon_MAIN_GPIO, (uint32_t)kModCon_MAIN_GPIO, (uint32_t)kModCon_MAIN_GPIO, (uint32_t)kModCon_MAIN_GPIO,                \
        (uint32_t)kModCon_MAIN_GPIO, (uint32_t)kModCon_WAKE_WAKE_GPIO, (uint32_t)kModCon_WAKE_WAKE_GPIO                                    \
    }                                                                                                                                      \

/*! @brief MODCON IP name array for LPIT. */
#define LPIT_MODCONS                                                                                                                       \
    {                                                                                                                                      \
        (uint32_t)kModCon_MAIN_LPIT0, (uint32_t)kModCon_MAIN_LPIT1                                                                         \
    }                                                                                                                                      \

/*! @brief MODCON IP name array for FLEXIO. */
#define FLEXIO_MODCONS                                                                                                                     \
    {                                                                                                                                      \
        (uint32_t)kModCon_MAIN_FLEXIO0, (uint32_t)kModCon_MAIN_FLEXIO1, (uint32_t)kModCon_MAIN_FLEXIO2                                     \
    }                                                                                                                                      \

/*! @brief MODCON IP name array for FLEXPWM. */
#define FLEXPWM_MODCONS                                                                                                                    \
    {                                                                                                                                      \
        (uint32_t)kModCon_MAIN_FLEXPWM0, (uint32_t)kModCon_MAIN_FLEXPWM1, (uint32_t)kModCon_MAIN_FLEXPWM2, (uint32_t)kModCon_MAIN_FLEXPWM3 \
    }                                                                                                                                      \

/*! @brief MODCON IP name array for SINC. */
#define SINC_MODCONS                                                                                                                       \
    {                                                                                                                                      \
        (uint32_t)kModCon_MAIN_SINC0, (uint32_t)kModCon_MAIN_SINC1                                                                         \
    }                                                                                                                                      \

/*
 * QTPM number has questions
 */


/*! @brief MODCON IP name array for CRC. */
#define CRC_MODCONS                                                                                                                        \
    {                                                                                                                                      \
        (uint32_t)kModCon_MAIN_CRC                                                                                                         \
    }                                                                                                                                      \

/*! @brief MODCON IP name array for IOMUXC. */
/* TBC VBAT?*/
#define IOMUXC_MODCONS                                                                                                                     \
    {                                                                                                                                      \
        (uint32_t)kModCon_MAIN_IOMUX, (uint32_t)kModCon_WAKE_IOMUX, (uint32_t)kModCon_WAKE_IOMUX                                           \
    }                                                                                                                                      \

/*! @brief MODCON IP name array for CGUA. */
#define CGUA_MODCONS                                                                                                                       \
    {                                                                                                                                      \
        (uint32_t)kModCon_MAIN_CGUA                                                                                                        \
    }                                                                                                                                      \

/*! @brief MODCON IP name array for STM. */
#define STM_MODCONS                                                                                                                        \
    {                                                                                                                                      \
        (uint32_t)kModCon_MAIN_STM                                                                                                         \
    }                                                                                                                                      \

/*! @brief MODCON IP name array for DAC. */
#define DAC_MODCONS                                                                                                                        \
    {                                                                                                                                      \
        (uint32_t)kModCon_MAIN_DAC                                                                                                         \
    }                                                                                                                                      \

/*! @brief MODCON IP name array for QTMR. */
#define QTMR_MODCONS                                                                                                                       \
    {                                                                                                                                      \
        (uint32_t)kModCon_MAIN_QTIMER0, (uint32_t)kModCon_MAIN_QTIMER1, (uint32_t)kModCon_MAIN_QTIMER2, (uint32_t)kModCon_MAIN_QTIMER3     \
    }                                                                                                                                      \

/*! @brief MODCON IP name array for ADC. */
#define ADC_MODCONS                                                                                                                        \
    {                                                                                                                                      \
        (uint32_t)kModCon_MAIN_ADC0, (uint32_t)kModCon_MAIN_ADC1                                                                           \
    }                                                                                                                                      \

