zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_modcon.h
/*! @brief MODCON IP name array for MIPI_CSI. */
#define MIPI_CSI_MODCONS                                                                                                                   \
    {                                                                                                                                      \
        (uint32_t)kModCon_MEDIA_MIPI_CSI                                                                                                   \
    }                                                                                                                                      \

/*! @brief MODCON IP name array for MIPI_DSI. */
#define MIPI_DSI_MODCONS                                                                                                                   \
    {                                                                                                                                      \
        (uint32_t)kModCon_MEDIA_MIPI_DSI                                                                                                   \
    }                                                                                                                                      \

/*! @brief MODCON IP name array for ISI. */
#define ISI_MODCONS                                                                                                                        \
    {                                                                                                                                      \
        (uint32_t)kModCon_MEDIA_ISI                                                                                                        \
    }                                                                                                                                      \

/*! @brief MODCON IP name array for DCIF. */
#define DCIF_MODCONS                                                                                                                       \
    {                                                                                                                                      \
        (uint32_t)kModCon_MEDIA_DCIF                                                                                                       \
    }                                                                                                                                      \

/*! @brief MODCON IP name array for JPEG. */
#define JPEG_MODCONS                                                                                                                       \
    {                                                                                                                                      \
        (uint32_t)kModCon_MEDIA_JPEG                                                                                                       \
    }                                                                                                                                      \

/*! @brief MODCON IP name array for GPU. */
#define GPU_MODCONS                                                                                                                        \
    {                                                                                                                                      \
        (uint32_t)kModCon_MEDIA_GPU                                                                                                        \
    }                                                                                                                                      \

/*! @brief MODCON IP name array for REFORMATTER. */
#define REFORMATTER_MODCONS                                                                                                                \
    {                                                                                                                                      \
        (uint32_t)kModCon_MEDIA_REFORMATTER                                                                                                \
    }                                                                                                                                      \

/*! @brief MODCON IP name array for CSI. */
#define CSI_MODCONS                                                                                                                        \
    {                                                                                                                                      \
        (uint32_t)kModCon_MEDIA_CSI                                                                                                        \
    }                                                                                                                                      \

/*! @brief MODCON IP name array for LPTMR. */
/* TBC VBAT missing*/
#define LPTMR_MODCONS                                                                                                                      \
    {                                                                                                                                      \
        (uint32_t)kModCon_WAKE_LPTIMER0, (uint32_t)kModCon_WAKE_LPTIMER0, (uint32_t)kModCon_WAKE_LPTIMER1                                  \
    }                                                                                                                                      \

/*! @brief MODCON IP name array for WAKE. */
#define WAKE_MODCONS                                                                                                                       \
    {                                                                                                                                      \
        (uint32_t)kModCon_WAKE_EWM                                                                                                         \
    }                                                                                                                                      \

/*! @brief MODCON IP name array for SWT. */
#define SWT_MODCONS                                                                                                                        \
    {                                                                                                                                      \
        (uint32_t)kModCon_WAKE_SWT0, (uint32_t)kModCon_WAKE_SWT1                                                                           \
    }                                                                                                                                      \

/*! @brief MODCON IP name array for ACMP. */
/* TBC 1 for all? */
#define ACMP_MODCONS                                                                                                                       \
    {                                                                                                                                      \
        (uint32_t)kModCon_WAKE_ACMP, (uint32_t)kModCon_WAKE_ACMP, (uint32_t)kModCon_WAKE_ACMP, (uint32_t)kModCon_WAKE_ACMP                 \
    }                                                                                                                                      \

