zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_modcon.h
/*! @brief MODCON IP name array for CGUANA. */
#define CGUANA_MODCONS                                                                                                                     \
    {                                                                                                                                      \
        (uint32_t)kModCon_WAKE_CGUANA                                                                                                      \
    }                                                                                                                                      \

/*! @brief MODCON IP name array for PMUANA. */
#define PMUANA_MODCONS                                                                                                                     \
    {                                                                                                                                      \
        (uint32_t)kModCon_WAKE_PMUANA                                                                                                      \
    }                                                                                                                                      \

/*! @brief MODCON IP name array for CGU. */
#define CGU_MODCONS                                                                                                                        \
    {                                                                                                                                      \
        (uint32_t)kModCon_WAKE_CGU                                                                                                         \
    }                                                                                                                                      \

/*
 * MEM, AXBS, IPD, CM85, CMPT, SSI, IAHBG, GF22, CM85_ECCINIT are missing
 */

/*
 * USB need further check
 */ 
/*
 * CCM need further check
 */
/*
 * What is MEDIA_CSI?
 */

/*******************************************************************************
 * API
 ******************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif /* __cplusplus */

/*!
 * @brief Get MODCON version.
 *
 * @param modcon MODCON instance.
 * @return MODCON version register value.
 */
uint32_t MODCON_GetVersion(modcon_instance_t modcon);

/*!
 * @brief Get MODCON trust mask.
 *
 * @param modcon MODCON instance.
 * @return MODCON trust mask register value.
 */
uint32_t MODCON_GetTrustMask(modcon_instance_t modcon);

/*!
 * @brief Set MODCON trust mask.
 *
 * @param modcon MODCON instance.
 * @param trustMask Trust mask value to set.
 * @param lock Whether to lock the trust mask setting.
 */
void MODCON_SetTrustMask(modcon_instance_t modcon, uint8_t trustMask, bool lock);

/*!
 * @brief Get IP domain mask.
 *
 * @param ip IP identifier.
 * @return IP domain mask register value.
 */
uint32_t MODCON_GetIPDomainMask(uint32_t ip);

/*!
 * @brief Set IP domain mask.
 *
 * @param ip IP identifier.
 * @param domainMask Domain mask value to set.
 * @param lock Whether to lock the domain mask setting.
 */
void MODCON_SetIPDomainMask(uint32_t ip, uint8_t domainMask, bool lock);

/*!
 * @brief Get IP reset status.
 *
 * @param ip IP identifier.
 * @return IP reset status register value.
 */
uint32_t MODCON_GetIPRST(uint32_t ip);

/*!
 * @brief Set IP reset.
 *
 * @param ip IP identifier.
 */
void MODCON_SetIPRST(uint32_t ip);

/*!
 * @brief Clear IP reset.
 *
 * @param ip IP identifier.
 */
void MODCON_ClearIPRST(uint32_t ip);

/*!
 * @brief Get IP configuration register value.
 *
 * @param ip IP identifier.
 * @param idx Configuration register index.
 * @return IP configuration register value.
 */
uint32_t MODCON_GetCFG(uint32_t ip, uint8_t idx);

/*!
 * @brief Set IP configuration register value.
 *
 * @param ip IP identifier.
 * @param idx Configuration register index.
 * @param value Configuration value to set.
 */
void MODCON_SetCFG(uint32_t ip, uint8_t idx, uint32_t value);

/*!
 * @brief Get IP status register value.
 *
 * @param ip IP identifier.
 * @param idx Status register index.
 * @return IP status register value.
 */
uint32_t MODCON_GetSts(uint32_t ip, uint8_t idx);

#if defined(__cplusplus)
}
#endif /* __cplusplus */

/*! @} */

#endif
